Revit 2027 API
VertexBuffer.GetVertexStreamPositionNormalColored Method
 Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexStreamPositionNormalColored GetVertexStreamPositionNormalColored()
Public Function GetVertexStreamPositionNormalColored As VertexStreamPositionNormalColored
public:
VertexStreamPositionNormalColored^ GetVertexStreamPositionNormalColored()
member GetVertexStreamPositionNormalColored : unit -> VertexStreamPositionNormalColored
Return Value
VertexStreamPositionNormalColored
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
Reference
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace